(tr7-show-result #t)
#f
(tr7-show-prompt #t)
#f
tr7> (import (srfi :1))
tr7> (xcons '(b c) 'a)
(a b c)
tr7> (cons* 1 2 3 4)
(1 2 3 . 4)
tr7> (cons* 1)
1
tr7> (list-tabulate 4 values)
(0 1 2 3)
tr7> (list-tabulate 4 (lambda (i) i))
(0 1 2 3)
tr7> (circular-list 'z 'q)
#1=(z q . #1#)
tr7> (iota 5)
(0 1 2 3 4)
tr7> (iota 5 0 -0.1)
(0.0 -0.1 -0.2 -0.3 -0.4)
tr7> (third '(a b c d e))
c
tr7> (take '(a b c d e) 2)
(a b)
tr7> (drop '(a b c d e) 2)
(c d e)
tr7> (take '(1 2 3 . d) 2)
(1 2)
tr7> (drop '(1 2 3 . d) 2)
(3 . d)
tr7> (take '(1 2 3 . d) 3)
(1 2 3)
tr7> (drop '(1 2 3 . d) 3)
d
tr7> (take-right '(a b c d e) 2)
(d e)
tr7> (drop-right '(a b c d e) 2)
(a b c)
tr7> (take-right '(1 2 3 . d) 2)
(2 3 . d)
tr7> (drop-right '(1 2 3 . d) 2)
(1)
tr7> (take-right '(1 2 3 . d) 0)
d
tr7> (drop-right '(1 2 3 . d) 0)
(1 2 3)
tr7> (take! (circular-list 1 3 5) 8)
(1 3)
tr7> (split-at '(a b c d e f g h) 3)
(a b c)
(d e f g h)
tr7> (last '(a b c))
c
tr7> (last-pair '(a b c))
(c)
tr7> (reverse '(a b c))
(c b a)
tr7> (reverse '(a (b c) d (e (f))))
((e (f)) d (b c) a)
tr7> (zip '(one two three) '(1 2 3) '(odd even odd even odd even odd even))
((one 1 odd) (two 2 even) (three 3 odd))
tr7> (zip '(1 2 3))
((1) (2) (3))
tr7> (zip '(3 1 4 1) (circular-list #f #t))
((3 #f) (1 #t) (4 #f) (1 #t))
tr7> (unzip2 '((1 one) (2 two) (3 three)))
(1 2 3)
(one two three)
tr7> (count even? '(3 1 4 1 5 9 2 5 6))
3
tr7> (count < '(1 2 4 8) '(2 4 6 8 10 12 14 16))
3
tr7> (count < '(3 1 4 1) (circular-list 1 10))
2
tr7> (fold cons* '() '(a b c) '(1 2 3 4 5))
(c 3 b 2 a 1)
tr7> (fold-right cons* '() '(a b c) '(1 2 3 4 5))
(a 1 b 2 c 3)
tr7> (unfold (lambda (x) (> x 10)) (lambda (x) (* x x)) (lambda (x) (+ x 1)) 1)
(1 4 9 16 25 36 49 64 81 100)
tr7> (unfold-right zero? (lambda (x) (* x x)) (lambda (x) (- x 1)) 10)
(1 4 9 16 25 36 49 64 81 100)
tr7> (append-map! (lambda (x) (list x (- x))) '(1 3 8))
(1 -1 3 -3 8 -8)
tr7> (pair-for-each (lambda (pair) (display pair) (newline)) '(a b c))
(a b c)
(b c)
(c)
#t
tr7> (filter-map (lambda (x) (and (number? x) (* x x))) '(a 1 b 3 c 7))
(1 9 49)
tr7> (filter even? '(0 7 8 8 43 -4))
(0 8 8 -4)
tr7> (partition symbol? '(one 2 3 four five 6))
(one four five)
(2 3 6)
tr7> (remove even? '(0 7 8 8 43 -4))
(7 43)
tr7> (find even? '(3 1 4 1 5 9))
4
tr7> (find-tail even? '(3 1 37 -8 -5 0 0))
(-8 -5 0 0)
tr7> (find-tail even? '(3 1 37 -5))
#f
tr7> (take-while even? '(2 18 3 10 22 9))
(2 18)
tr7> (drop-while even? '(2 18 3 10 22 9))
(3 10 22 9)
tr7> (span even? '(2 18 3 10 22 9))
(2 18)
(3 10 22 9)
tr7> (break even? '(3 1 4 1 5 9))
(3 1)
(4 1 5 9)
tr7> (any integer? '(a 3 b 2.7))
#t
tr7> (any integer? '(a 3.1 b 2.7))
#f
tr7> (any < '(3 1 4 1 5) '(2 7 1 8 2))
#t
tr7> (list-index even? '(3 1 4 1 5 9))
2
tr7> (list-index < '(3 1 4 1 5 9 2 5 6) '(2 7 1 8 2))
1
tr7> (list-index = '(3 1 4 1 5 9 2 5 6) '(2 7 1 8 2))
#f
tr7> (delete-duplicates '(a b a c a b c z))
(a b c z)
tr7> (delete-duplicates '((a . 3) (b . 7) (a . 9) (c . 1)) (lambda (x y) (eq? (car x) (car y))))
((a . 3) (b . 7) (c . 1))
tr7> (lset<= eq? '(a) '(a b a) '(a b c c))
#t
tr7> (lset<= eq?)
#t
tr7> (lset<= eq? '(a))
#t
tr7> (lset= eq? '(b e a) '(a e b) '(e e b a))
#t
tr7> (lset-adjoin eq? '(a b c d c e) 'a 'e 'i 'o 'u)
(u o i a b c d c e)
tr7> (lset-union eq? '(a b c d e) '(a e i o u))
(u o i a b c d e)
tr7> (lset-union eq? '(a a c) '(x a x))
(x a a c)
tr7> (lset-union eq?)
()
tr7> (lset-union eq? '(a b c))
(a b c)
tr7> (lset-intersection eq? '(a b c d e) '(a e i o u))
(a e)
tr7> (lset-intersection eq? '(a x y a) '(x a x z))
(a x a)
tr7> (lset-intersection eq? '(a b c))
(a b c)
tr7> (lset-difference eq? '(a b c d e) '(a e i o u))
(b c d)
tr7> (lset-difference eq? '(a b c))
(a b c)
tr7> (lset-xor eq? '(a b c d e) '(a e i o u))
(u o i b c d)
tr7> (lset-xor eq?)
()
tr7> (lset-xor eq? '(a b c d e))
(a b c d e)
tr7> 